<template>
  <div>
    <h1>概要</h1>
    <body>
      私は学部の卒業研究として,
      サーバレス実行方式という近年提案されたクラウド技術の改善を行いました.期間は2019年4月から2020年3月になります.<br />
      従来のクラウド技術ではアプリケーションを稼働すると処理をしていない際も常に稼働していることが多いです.
      よって無駄なメモリを消費してしまうという欠点があります.サーバレス実行方式は従来のクラウド技術と違い,処理をしている時だけ稼働し,処理が終了すると環境自体を破棄します.
      環境を破棄することで使用メモリを削減できますが, 起動が遅く,
      レイテンシが大きい点が問題です.レイテンシを小さくするため,先行研究として一定時間コンテナを保持する手法がありますが,非処理時でもメモリを消費します.<br />
      本研究ではメモリ量とレイテンシ両方の削減のため,CRIUを使用したコンテナ起動方法を提案しました.コンテナを0から作成,起動するのではなく,起動済みコンテナのメモリ状態から復元することで初期処理の時間を省くことができます.この実装をするにあたって私はDocker,
      Kubernetes, そしてKnativeを主に利用しました.
      Dockerには復元起動の機能が実験的に実装されています.
      しかしKubernetesにはそのような機能がないため自分で作成しました.<br />
      この起動方法はすべてのコンテナに有効ではありません.そのため適切なコンテナの条件を実験により明らかにしました.また実用されているソフトウェアでも評価を行い,条件が適切であることを確認しました.
    </body>
  </div>
</template>

<script>
export default {
  name: "Overview",

  data: () => ({
    //
  }),
};
</script>
